app/controllers/clubs_controller.rb

  def create
    raise StandardError, "You are not authorized to create a club" unless [ "admin" ].include?(current_user.role.name)
    @club = Club.new(club_params)

    respond_to do |format|
      if @club.save
        Membership.create!(
          club_id: @club.reload.id,
          user_id: current_user.id
        )
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "clubs" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Test Club"], ["description", "Test Description"], ["created_at", "2025-03-23 10:16:09.579506"], ["updated_at", "2025-03-23 10:16:09.579506"]]
INSERT INTO "memberships" ("user_id", "club_id", "member_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["club_id", 1], ["member_type", 0], ["created_at", "2025-03-23 10:16:09.582705"], ["updated_at", "2025-03-23 10:16:09.582705"]]

  def update
    respond_to do |format|
      if @club.update(club_params)
---
UPDATE "clubs" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "clubs"."id" = ?  [["name", "Updated Club"], ["description", "Updated Description"], ["updated_at", "2025-03-23 10:11:50.107875"], ["id", 1]]

  def destroy
    @club.destroy
---
DELETE FROM "clubs" WHERE "clubs"."id" = ?  [["id", 1]]

  def search_members
    @query = params[:query]
    @users = User.where.not(id: @club.users.pluck(:id))
                .where("email LIKE ? OR name LIKE ?", "%#{@query}%", "%#{@query}%")
                .limit(10)
---
SELECT "users"."id" FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."club_id" = ?  [["club_id", 1]]

  def add_member
    user = User.find(params[:user_id])

    if @club.memberships.create(user: user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "memberships" ("user_id", "club_id", "member_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["club_id", 1], ["member_type", 0], ["created_at", "2025-03-23 10:11:50.169223"], ["updated_at", "2025-03-23 10:11:50.169223"]]

  def set_club
    @club = Club.find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]